In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df = pd.read_csv('PPR-2010-2023.csv')

/var/folders/55/j0v2zlbn1575rkmztsycxlfw0000gn/T/ipykernel_7020/3239213054.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv('PPR-2010-2023.csv')

In [3]:
df['Property Size Description'].unique()

array([nan,
       'greater than or equal to 38 sq metres and less than 125 sq metres',
       'greater than 125 sq metres', 'less than 38 sq metres',
       'greater than or equal to 125 sq metres',
       'níos mó ná nó cothrom le 38 méadar cearnach agus níos lú ná 125 méadar cearnach',
       'n?os l? n? 38 m?adar cearnach'], dtype=object)

In [4]:
df[df['Eircode'].notna()]

,Date of Sale (dd/mm/yyyy),Address,County,Eircode,Price (),Not Full Market Price,VAT Exclusive,Description of Property,Property Size Description
73089,24/05/2013,"70 CHARLESTOWN PARK, ST MARGARETS RD, DUBLIN 11",Dublin,D11TX45,"216,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
74788,17/06/2013,"CASTLENUGENT, LISRYAN, CO. LONGFORD",Longford,N39TP27,"35,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
75132,21/06/2013,"15 ROWAN TERRACE, NEWBRIDGE, KILDARE",Kildare,W12FX56,"120,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
75941,28/06/2013,"MONEEN, WILLIAMSTOWN, CO GALWAY",Galway,F45CX85,"13,750.00",Yes,No,Second-Hand Dwelling house /Apartment,NaN
84319,03/10/2013,"55 HARRISONS PLACE, CHALEVILLE, CORK",Cork,P56PN22,"30,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
...,...,...,...,...,...,...,...,...,...
589017,16/03/2023,"CRAGBEG, CLARINA, LIMERICK",Limerick,V94NFT9,"76,000.00",Yes,No,Second-Hand Dwelling house /Apartment,NaN
589019,16/03/2023,"NO 1 PRIORY HALL, BALLAGHADERREEN, CO ROSCOMMON",Roscommon,F45Y029,"135,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
589020,16/03/2023,"RAMPARK, JENKINSTOWN, DUNDALK",Louth,A91CD86,"305,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
589021,16/03/2023,"ROSSNAPARTEN, LOW ROAD SHROOVE, GREENCASTLE",Donegal,F93NVW5,"430,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN
589023,16/03/2023,"TOSCANA, BALDWINSTOWN, WEXFORD",Wexford,Y35HH92,"325,000.00",No,No,Second-Hand Dwelling house /Apartment,NaN

In [5]:
df['Description of Property'].unique()

array(['Second-Hand Dwelling house /Apartment',
       'New Dwelling house /Apartment', 'Teach/Árasán Cónaithe Atháimhe',
       'Teach/Árasán Cónaithe Nua', 'Teach/?ras?n C?naithe Nua'],
      dtype=object)

In [6]:
county = df['County'].unique()
county

array(['Dublin', 'Laois', 'Meath', 'Kilkenny', 'Limerick', 'Carlow',
       'Cork', 'Clare', 'Sligo', 'Cavan', 'Tipperary', 'Wicklow',
       'Roscommon', 'Wexford', 'Mayo', 'Donegal', 'Longford', 'Galway',
       'Offaly', 'Kildare', 'Waterford', 'Louth', 'Kerry', 'Westmeath',
       'Monaghan', 'Leitrim'], dtype=object)

In [7]:
df.columns

Index(['Date of Sale (dd/mm/yyyy)', 'Address', 'County', 'Eircode',
       'Price ()', 'Not Full Market Price', 'VAT Exclusive',
       'Description of Property', 'Property Size Description'],
      dtype='object')

In [8]:
l = []
for column in df.columns:
    l.append(len(df[df[column].isna()]))

In [9]:
l

[0, 0, 0, 503057, 0, 0, 0, 0, 536210]

$\therefore$ Eircode and Property Size Descriptions have a lot of NA values so we will ignore those 2 columns

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 589024 entries, 0 to 589023
Data columns (total 9 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Date of Sale (dd/mm/yyyy)  589024 non-null  object
 1   Address                    589024 non-null  object
 2   County                     589024 non-null  object
 3   Eircode                    85967 non-null   object
 4   Price ()                  589024 non-null  object
 5   Not Full Market Price      589024 non-null  object
 6   VAT Exclusive              589024 non-null  object
 7   Description of Property    589024 non-null  object
 8   Property Size Description  52814 non-null   object
dtypes: object(9)
memory usage: 40.4+ MB

for every row in address
split string and choose the last index
if " " in last index
split(" ")[-1]
if the last index == county
delete the last index
else
pass
index[-2] is the town name

In [11]:
df = df.drop('Property Size Description', axis=1)

In [12]:
df = df.drop('Eircode',axis=1)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 589024 entries, 0 to 589023
Data columns (total 7 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Date of Sale (dd/mm/yyyy)  589024 non-null  object
 1   Address                    589024 non-null  object
 2   County                     589024 non-null  object
 3   Price ()                  589024 non-null  object
 4   Not Full Market Price      589024 non-null  object
 5   VAT Exclusive              589024 non-null  object
 6   Description of Property    589024 non-null  object
dtypes: object(7)
memory usage: 31.5+ MB

In [14]:
def clean_price(string):
    string = string.replace(",","")
    return float(string[1:])
Price = df['Price ()'].apply(clean_price)

In [15]:
df = df.drop('Price ()',axis=1)

In [16]:
df['Price'] = Price

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 589024 entries, 0 to 589023
Data columns (total 7 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   Date of Sale (dd/mm/yyyy)  589024 non-null  object
 1   Address                    589024 non-null  object
 2   County                     589024 non-null  object
 3   Not Full Market Price      589024 non-null  object
 4   VAT Exclusive              589024 non-null  object
 5   Description of Property    589024 non-null  object
 6   Price                      589024 non-null  float64
dtypes: float64(1), object(6)
memory usage: 31.5+ MB

In [18]:
df["VAT Exclusive"].value_counts().unique()

array([494042,  94982])

In [19]:
df['Not Full Market Price'] = df['Not Full Market Price'].apply(lambda x: 0 if x == "No" else 1)

In [20]:
df.head()

,Date of Sale (dd/mm/yyyy),Address,County,Not Full Market Price,VAT Exclusive,Description of Property,Price
0,01/01/2010,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,0,No,Second-Hand Dwelling house /Apartment,343000.0
1,03/01/2010,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,0,Yes,New Dwelling house /Apartment,185000.0
2,04/01/2010,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,0,No,Second-Hand Dwelling house /Apartment,438500.0
3,04/01/2010,"1 The Haven, Mornington",Meath,0,No,Second-Hand Dwelling house /Apartment,400000.0
4,04/01/2010,"11 Melville Heights, Kilkenny",Kilkenny,0,No,Second-Hand Dwelling house /Apartment,160000.0

In [21]:
df['VAT Exclusive'] = df['VAT Exclusive'].apply(lambda x: 0 if x == "No" else 1)

In [22]:
df.head()

,Date of Sale (dd/mm/yyyy),Address,County,Not Full Market Price,VAT Exclusive,Description of Property,Price
0,01/01/2010,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,0,0,Second-Hand Dwelling house /Apartment,343000.0
1,03/01/2010,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,0,1,New Dwelling house /Apartment,185000.0
2,04/01/2010,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,0,0,Second-Hand Dwelling house /Apartment,438500.0
3,04/01/2010,"1 The Haven, Mornington",Meath,0,0,Second-Hand Dwelling house /Apartment,400000.0
4,04/01/2010,"11 Melville Heights, Kilkenny",Kilkenny,0,0,Second-Hand Dwelling house /Apartment,160000.0

In [23]:
df['Date'] = df['Date of Sale (dd/mm/yyyy)']

In [24]:
df = df.drop('Date of Sale (dd/mm/yyyy)',axis=1)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 589024 entries, 0 to 589023
Data columns (total 7 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Address                  589024 non-null  object
 1   County                   589024 non-null  object
 2   Not Full Market Price    589024 non-null  int64
 3   VAT Exclusive            589024 non-null  int64
 4   Description of Property  589024 non-null  object
 5   Price                    589024 non-null  float64
 6   Date                     589024 non-null  object
dtypes: float64(1), int64(2), object(4)
memory usage: 31.5+ MB

In [26]:
df['Date'] = pd.to_datetime(df['Date'])

/var/folders/55/j0v2zlbn1575rkmztsycxlfw0000gn/T/ipykernel_7020/2394721818.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Date'] = pd.to_datetime(df['Date'])

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 589024 entries, 0 to 589023
Data columns (total 7 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Address                  589024 non-null  object
 1   County                   589024 non-null  object
 2   Not Full Market Price    589024 non-null  int64
 3   VAT Exclusive            589024 non-null  int64
 4   Description of Property  589024 non-null  object
 5   Price                    589024 non-null  float64
 6   Date                     589024 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(2), object(3)
memory usage: 31.5+ MB

In [28]:
df['Description of Property'].unique()

array(['Second-Hand Dwelling house /Apartment',
       'New Dwelling house /Apartment', 'Teach/Árasán Cónaithe Atháimhe',
       'Teach/Árasán Cónaithe Nua', 'Teach/?ras?n C?naithe Nua'],
      dtype=object)

'Teach/Árasán Cónaithe Atháimhe' = 'Second hand House/Apartment'  

'Teach/Árasán Cónaithe Nua' = 'New House/Apartment'  

'Teach/?ras?n C?naithe Nua' = 'New House/Apartment'  

'New Dwelling house /Apartment' = 'New House/Apartment'  

'Second-Hand Dwelling house /Apartment' = 'Second Hand House/Apartment'

In [29]:
replacement_dict = {
    'Second-Hand Dwelling house /Apartment':'Second-Hand',
    'New Dwelling house /Apartment':'New',
    'Teach/Árasán Cónaithe Atháimhe':'Second-Hand',
    'Teach/Árasán Cónaithe Nua':'New',
    'Teach/?ras?n C?naithe Nua':'New'
}

In [30]:
df['Description of Property'] = df['Description of Property'].replace(replacement_dict)

In [31]:
df.head()

,Address,County,Not Full Market Price,VAT Exclusive,Description of Property,Price,Date
0,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,0,0,Second-Hand,343000.0,2010-01-01
1,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,0,1,New,185000.0,2010-03-01
2,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,0,0,Second-Hand,438500.0,2010-04-01
3,"1 The Haven, Mornington",Meath,0,0,Second-Hand,400000.0,2010-04-01
4,"11 Melville Heights, Kilkenny",Kilkenny,0,0,Second-Hand,160000.0,2010-04-01

In [32]:
df = df[['Date','Address','County','Price','Not Full Market Price','VAT Exclusive','Description of Property']]

In [33]:
df.head()

,Date,Address,County,Price,Not Full Market Price,VAT Exclusive,Description of Property
0,2010-01-01,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,343000.0,0,0,Second-Hand
1,2010-03-01,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,185000.0,0,1,New
2,2010-04-01,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,438500.0,0,0,Second-Hand
3,2010-04-01,"1 The Haven, Mornington",Meath,400000.0,0,0,Second-Hand
4,2010-04-01,"11 Melville Heights, Kilkenny",Kilkenny,160000.0,0,0,Second-Hand

In [34]:
address = df['Address']

In [35]:
address[0].split(',')[-1]

' Co.Dublin'

In [36]:
for i in range(10):
    display(df['Address'].loc[i])

'5 Braemor Drive, Churchtown, Co.Dublin'

'134 Ashewood Walk, Summerhill Lane, Portlaoise'

'1 Meadow Avenue, Dundrum, Dublin 14'

'1 The Haven, Mornington'

'11 Melville Heights, Kilkenny'

'12 Sallymount Avenue, Ranelagh'

'13  Oakleigh Wood, Dooradoyle, Limerick'

'13 The Drive, Chapelstown Gate, Tullow Road'

'15 Carriglawn, Waterpark, Carrigaline'

'15a Moore Bay, Kilkee'

In [37]:
df['Address'].loc[3].split(',')[-1][1:]

'Mornington'

In [38]:
df['Address'].loc[0].split(',')[:-1][-1].strip()

'Churchtown'

In [39]:
# for i in range(len(df)):
#     if df['Address'].loc[i].split(',')[-1][1:] == df['County'].loc[i]:
#         df['Address'].loc[i] = df['Address'].loc[i].split(',')[:-1][-1].strip()
#     else:
#         continue

In [41]:
df['County'].loc[0].lower()

'dublin'

In [47]:
df['Address'].loc[0].split(',')[-1][1:].split('.')[-1].lower()

'dublin'

In [49]:
df['Address'].loc[0].split(',')[-2][1:]

'Churchtown'

In [55]:
Town = []
for i in range(len(df)):
    if df['Address'].loc[i].split(',')[-1][1:].split('.')[-1].lower() == df['County'].loc[i].lower():
        Town.append(df['Address'].loc[i].split(',')[-2][1:])
    else:
        Town.append(df['Address'].loc[i].split(',')[-1][1:])

In [56]:
len(Town)

589024

In [57]:
df['Town'] = Town

In [58]:
df.head()

,Date,Address,County,Price,Not Full Market Price,VAT Exclusive,Description of Property,Town
0,2010-01-01,"5 Braemor Drive, Churchtown, Co.Dublin",Dublin,343000.0,0,0,Second-Hand,Churchtown
1,2010-03-01,"134 Ashewood Walk, Summerhill Lane, Portlaoise",Laois,185000.0,0,1,New,Portlaoise
2,2010-04-01,"1 Meadow Avenue, Dundrum, Dublin 14",Dublin,438500.0,0,0,Second-Hand,Dublin 14
3,2010-04-01,"1 The Haven, Mornington",Meath,400000.0,0,0,Second-Hand,Mornington
4,2010-04-01,"11 Melville Heights, Kilkenny",Kilkenny,160000.0,0,0,Second-Hand,1 Melville Heights

In [67]:
d15 = df[df['Town'] == 'Dublin 15']

In [68]:
d15.loc[d15['Price'].idxmax()]

Date                                                     2020-10-29 00:00:00
Address                    1-46 Royal Canal Crescent, Rathborne Park, Dub...
County                                                                Dublin
Price                                                            16308370.05
Not Full Market Price                                                      0
VAT Exclusive                                                              1
Description of Property                                                  New
Town                                                               Dublin 15
Name: 444703, dtype: object

In [69]:
df.loc[df['Price'].idxmax()]

Date                                            2023-10-02 00:00:00
Address                    O'Devaney Gardens, Arbour Hill, Dublin 7
County                                                       Dublin
Price                                                   225000000.0
Not Full Market Price                                             1
VAT Exclusive                                                     1
Description of Property                                         New
Town                                                       Dublin 7
Name: 585087, dtype: object

In [70]:
df_cleaned = df[['Date','Town','County','Price','Not Full Market Price','VAT Exclusive','Description of Property']]

In [71]:
df_cleaned

,Date,Town,County,Price,Not Full Market Price,VAT Exclusive,Description of Property
0,2010-01-01,Churchtown,Dublin,343000.0,0,0,Second-Hand
1,2010-03-01,Portlaoise,Laois,185000.0,0,1,New
2,2010-04-01,Dublin 14,Dublin,438500.0,0,0,Second-Hand
3,2010-04-01,Mornington,Meath,400000.0,0,0,Second-Hand
4,2010-04-01,1 Melville Heights,Kilkenny,160000.0,0,0,Second-Hand
...,...,...,...,...,...,...,...
589019,2023-03-16,CO ROSCOMMON,Roscommon,135000.0,0,0,Second-Hand
589020,2023-03-16,DUNDALK,Louth,305000.0,0,0,Second-Hand
589021,2023-03-16,GREENCASTLE,Donegal,430000.0,0,0,Second-Hand
589022,2023-03-16,KNOCKNAGOSHEL,Kerry,50000.0,0,0,Second-Hand
589023,2023-03-16,BALDWINSTOWN,Wexford,325000.0,0,0,Second-Hand

In [72]:
df_cleaned.to_csv('PPR-cleaned.csv',index=False)